---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures
source: html/486e2742-5731-6992-d480-ec44ae035cae.htm
---
# BuiltInFailures.ConstraintFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.